app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "user_id", "parent_comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "reply comment"], ["post_id", 2], ["user_id", 1], ["parent_comment_id", nil], ["created_at", "2023-06-08 11:04:21.258703"], ["updated_at", "2023-06-08 11:04:21.258703"]]
---
    def create
      comment=params[:comment]
      post_id=comment[:post_id]

      @post = Post.find(post_id)

      @parent_comment = Comment.find(params[:comment_id]) if params[:comment_id].present?

      @comment = @post.comments.build(comment_params)
      @comment.parent_comment = @parent_comment if @parent_comment

      if @comment.save

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "dsdsd"], ["updated_at", "2023-06-08 10:47:26.712247"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)