app/controllers/friend_requests_controller.rb

  def index
    @friend_requests = FriendRequest.all
---
SELECT "friend_requests".* FROM "friend_requests"