app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["created_at", "2023-06-08 08:02:44.702380"], ["updated_at", "2023-06-08 08:02:44.702380"]]
---
  def create
    post = Post.find(params[:id])
    like = post.likes.build(user: current_user)

    if like.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 15]]
---
  def destroy
    post = Post.find(params[:id])
    like = Like.find_by(post:post,user:current_user)

    if like
      like.destroy

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_like
      @like = Like.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
    def like_owner
      @post = Post.find(params[:id])
      @like = Like.find_by(post:@post,user:current_user)