app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "likes"."user_id" FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
  def show
    @post = Post.find(params[:id])
    @likes = @post.likes.pluck(:user_id)
    @comments = @post.comments.includes(:replies)

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "third Post"], ["content", "sdsdsdsacs"], ["user_id", 1], ["created_at", "2023-06-08 11:15:39.434977"], ["updated_at", "2023-06-08 11:15:39.434977"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = ?, "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "this my second pos st"], ["user_id", 2], ["updated_at", "2023-06-08 12:20:51.910003"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)