app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Rehan"], ["password", "[FILTERED]"], ["created_at", "2023-06-08 06:22:32.749864"], ["updated_at", "2023-06-08 06:22:32.749864"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "[FILTERED]"], ["updated_at", "2023-06-08 07:07:59.535625"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)